/* 
  KPKLocalizable.strings
  MacPass

  Created by Michael Starke on 20/12/13.
  Copyright (c) 2013 HicknHack Software GmbH. All rights reserved.
*/

"SET_TITLE" = "编辑标题";
"SET_USERNAME" = "编辑用户名";
"SET_PASSWORD" = "编辑密码";
"SET_URL" = "编辑 URL";
"SET_NOTES" = "编辑注释";

"DATABASE" = "数据库";
"GENERAL" = "通用";
"EMAIL" = "电子邮件";
"HOMEBANKING" = "家庭银行";
"INTERNET" = "互联网";
"NETWORK" = "网络";
"TRASH" = "废纸篓";
"WINDOWS" = "Windows";

/* Copy */
"KPK_GROUP_COPY_%@" = "%@ 拷贝";
"KPK_ENTRY_COPY_%@" = "%@ 拷贝";

/* Validation Errors */
"ERROR_WINDOW_TITLE_VALIDATION_FAILED" = "窗口标题格式不正确！";
"ERROR_ATTRIBUTE_KEY_VALIDATION_FAILED" = "属性键 (Attribute Key) 不唯一！";
"ERROR_AUTOTYPE_SEQUENCE_VALIDATION_FAILED" = "自动键入序列不正确！";

/* Errors */
"ERROR_CORRUPT_TREE" = "内部文件结构已损坏！";
"ERROR_INVALID_FIELD_SIZE" = "数据字段大小错误，可能是由于密码错误。";
"ERROR_INVALID_FIELD_TYPE" = "未知数据字段，可能是由于密码错误。";
"ERROR_UNSUPPORTED_DATABASER_VERSION" = "不支持的数据库版本";
"ERROR_UNSUPPORTED_CHIPHER" = "不支持的密码算法";
"ERROR_UNKNOWN_FILE_FORMAT" = "未知文件格式";
"ERROR_HEADER_CORRUPTED" = "文件头已损坏";
"ERROR_UNSUPPORTED_KDBX_COMPRESSION_ALGORITHM" = "不支持的压缩算法";
"ERROR_UNSUPPORTED_KDBX_RANDOM_STREAM" = "不支持的随机流 (random stream) 种类";
"ERROR_INTEGRITY_CHECK_FAILED" = "数据库完整性已被破坏";
"ERROR_PASSWORD_OR_KEYFILE_WRONG" = "密码与/或密钥文件错误";
"ERROR_KEEPASSFILE_ELEMENT_MISSING" = "XML 文件缺少 KeePassFile 元素";
"ERROR_ROOT_ELEMENT_MISSING" = "XML 文件未包含根节点";
"ERROR_GROUP_ELEMENT_MISSING" = "XML 文件未包含组节点";
"ERROR_HEADER_HASH_MISSMATCH" = "文件头哈希不匹配，文件已损坏";
"ERROR_XML_KEYFILE_WITHOUT_KEY_ELEMENT" = "XML 密钥文件缺少键 (key) 元素";
"ERROR_XML_KEYFILE_WITHOUT_DATA_ELEMENT" = "XML 密钥文件缺少数据 (data) 元素";
"ERROR_XML_KEYFILE_DATA_PARSING_ERROR" = "无法读取 XML 密钥文件的数据";
"ERROR_HEADER_HASH_VERIFICATION_FAILED" = "数据库文件头哈希错误，数据可能已经被破坏！";
